---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeTableIterator.Reset
source: html/bbe88f6f-2565-e6d7-4ad9-82fcb574df88.htm
---
# Autodesk.Revit.DB.ExportLinetypeTableIterator.Reset Method

Resets the iterator to the initial state.

## Syntax (C#)
```csharp
public virtual void Reset()
```